blog-posts/2003-12-30-tla-migration-to-04-archive.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>TLA migration to 04 archive</title>
<!-- 2015-01-07 Wed 14:47 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link href='http://fonts.googleapis.com/css?family=Open+Sans' rel='stylesheet' type='text/css'></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">TLA migration to 04 archive</h1>
<p>
December 30th, 2003 -
<a href="http://sachachua.com/blog/p/1541"><a href="http://sachachua.com/blog/p/1541">http://sachachua.com/blog/p/1541</a></a>
</p>

<pre class="example">
cd ~/notebook/emacs/emacs-wiki/
tla register-archive sacha@free.net.ph--main ~/notebook/arch/
tla my-default-archive sacha@free.net.ph--main
tla make-archive -l sacha@free.net.ph
tla tag sacha@free.net.ph--03/emacs-wiki--sacha--1.0 emacs-wiki--sacha--1.0
tla cacherev
</pre>

<p>
Here I use -l to make sure my archive is http-gettable, then tag the
 old file over to the new one, then cache the old revisions to make
 this run faster.
</p>

<p>
To update to Damien's tree, just:
</p>

<pre class="example">
tla star-merge arch@repose.cx--03/emacs-wiki--dev--1.0
</pre>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
